1.Write a Pandas program to create a dataframe from a dictionary and display it.
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [3]:
import pandas as pd
import numpy as np

In [5]:
pd.DataFrame({'X': [78,85,96,80,86], 'Y': [84,94,89,83,86], 'Z' : [86,97,96,72,83]})

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [ ]:
2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
Sample Python dictionary data and list labels:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [68]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [69]:
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [ ]:
3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.
Sample Python dictionary data and list labels:

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 452.0+ bytes

In [ ]:
4. Write a Pandas program to get the first 3 rows of a given DataFrame.
Sample Python dictionary data and list labels:

In [10]:
df.head(3)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes

In [ ]:
5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.
Sample Python dictionary data and list labels:

In [11]:
df[["name","score"]]

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5
3      James    NaN
4      Emily    9.0
5    Michael   20.0
6    Matthew   14.5
7      Laura    NaN
8      Kevin    8.0
9      Jonas   19.0

In [ ]:
6. Write a Pandas program to select the specified columns and rows from a given data frame.
Sample Python dictionary data and list labels:
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [25]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [70]:
df2 = pd.DataFrame(exam_data, index = labels)

In [31]:
df2.iloc[[1,3,5,6],[1,3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [ ]:
7. Write a Pandas program to select the rows where the number of attempts in the
examination is greater than 2.

In [34]:
df2[df2.attempts > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [ ]:
8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [38]:
print("Rows",len(df2))
print("Columns",len(df2.columns))

Rows 10
Columns 4

In [ ]:
9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [42]:
df2[df2.score.isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [ ]:
10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [54]:
df2[df2.score >=15]

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [60]:
df2[df2.score.between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [ ]:
Write a Pandas program to select the rows where number of attempts in the examination is 
less than 2 and score greater than 15.

In [65]:
df2[(df2.attempts < 2) & (df2.score >15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [63]:
12. Write a Pandas program to change the score in row 'd' to 11.5.

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [72]:
df3 = df2

In [85]:
df3.iloc[3,1] = 11.5
df3.loc['d','score'] = 11.5

In [88]:
df3

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
13. Write a Pandas program to calculate the sum of the examination attempts by the students

In [89]:
df3.attempts.sum()

19

In [ ]:
14. Write a Pandas program to calculate the mean of all students scores. Data is stored
in a dataframe.

In [90]:
df3.score.mean()

13.333333333333334

In [ ]:
15. Write a Pandas program to append a new row 'k' to data frame with given values for 
each column. Now delete the new row and return the original DataFrame

Values for each column will be:
name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"

In [92]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [94]:
df4 = pd.DataFrame(exam_data , index = labels)
df4

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [95]:
df4.loc['k'] = ["Suresh",15.5,1,"yes"]

In [103]:
df4.drop('k', inplace = True)

In [ ]:
16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, 
then by 'score' in ascending order.

In [107]:
df4.sort_values(by = ['name','score'], ascending = [False,True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [123]:
df4.qualify.replace({'yes':'True', 'no': 'False'}, inplace = True)

### Or

df4.qualify.map({'yes':'True','no':'False'},inplace = True)

a     True
b    False
c     True
d    False
e    False
f     True
g     True
h    False
i    False
j     True
Name: qualify, dtype: object

In [120]:
df4

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d      James    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

In [ ]:
18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [129]:
df00 = df4

TypeError: Series.map() got an unexpected keyword argument 'inplace'

In [131]:
df4.replace({'James':'Suresh'},inplace = True)

In [132]:
df4

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d     Suresh    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

In [ ]:
19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [134]:
df4.drop('attempts', axis = 1,inplace = True)

In [135]:
df4

        name  score qualify
a  Anastasia   12.5    True
b       Dima    9.0   False
c  Katherine   16.5    True
d     Suresh    NaN   False
e      Emily    9.0   False
f    Michael   20.0    True
g    Matthew   14.5    True
h      Laura    NaN   False
i      Kevin    8.0   False
j      Jonas   19.0    True

In [ ]:
20. Write a Pandas program to insert a new column in existing DataFrame.

In [143]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [147]:
df5 = pd.DataFrame(exam_data, index = labels)
df5

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [148]:
### Addind new Column Colour

df5['color'] = ['Red','Blue', 'Orange','Red','White','White','Blue','Green', 'Green', 'Red']

In [149]:
df5

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

In [ ]:
21. Write a Pandas program to iterate over rows in a DataFrame.

In [150]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]

In [153]:
df21 = pd.DataFrame(exam_data)

In [154]:
df21

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5

In [160]:
for index,row in df21.iterrows():
    print(row['name'],row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

In [ ]:
22. Write a Pandas program to get list from DataFrame column headers.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [177]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df22 = pd.DataFrame(exam_data, index = labels)

In [178]:
list(df22.columns.values)

['name', 'score', 'attempts', 'qualify']

In [ ]:
23. Write a Pandas program to rename columns of a given DataFrame
Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
New DataFrame after renaming columns:
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [188]:
df23 = pd.DataFrame({'col1':[1,2,3], 'col2' : [4,5,6], 'col3': [7,8,9]})
print(df23)

print("After Rename:\n \n", df23.rename(columns = {'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'}))

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
After Rename:

    Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [ ]:
24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.
Sample data:
    
    Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Rows for colum1 value == 4
   col1  col2  col3
1     4     5     8
3     4     7     0

In [230]:
df24 = pd.DataFrame({'col1': [1,4,3,4,5], 'col2': [4,5,6,7,8], 'col3': [7,8,9,0,1]})
df24

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [208]:
df24.iloc[df24['col1'] == 4]

NotImplementedError: iLocation based boolean indexing on an integer type is not available

In [209]:
df24.loc[df24['col1'] == 4]

   col1  col2  col3
1     4     5     8
3     4     7     0

In [ ]:
25. Write a Pandas program to change the order of a DataFrame columns.

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
After altering col1 and col3
   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

In [218]:
df24.columns = df24.columns.sort_values(ascending = False)

In [216]:
df01 = df24

In [219]:
df24

   col3  col2  col1
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [220]:
## Or

df24 [['col3','col2', 'col1']]

   col3  col2  col1
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [ ]:
26. Write a Pandas program to add one row in an existing DataFrame.

Sample data:
Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
After add one row:
   col1  col2  col3
0     1     4     7 
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

In [227]:
df24[['col1','col2','col3']]

   col1  col2  col3
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5
5    12    11    10

In [232]:
df24.loc[len(df24)] = [10, 11, 12]

In [233]:
df24

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

In [ ]:
27. Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [239]:
df24.to_csv('new_file.csv',sep = '\t',index = False,encoding = None)

In [240]:
### Cross Verification:
pd.read_csv("/Users/swethag/new_file.csv")

  col1\tcol2\tcol3
0          1\t4\t7
1          4\t5\t8
2          3\t6\t9
3          4\t7\t0
4          5\t8\t1
5       10\t11\t12

In [ ]:
28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [262]:
df28 = pd.DataFrame({'name' : ['Swe','Doll','Ashu','Sushma', 'Sumith', 'Akanksha','Eddy','Sam','Bhavana','Francis'],
'city': ['California','Georgia','Los Angeles','California','Los Angeles','California','California','Los Angeles','Georgia','Los Angeles']})

In [270]:
df28.groupby("city").count().rename(columns = {'name': 'Number of people'}).reset_index()

### Or

df28.groupby("city").size().reset_index(name ='Number of people' )

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [ ]:
29. Write a Pandas program to delete DataFrame row(s) based on given column value.

Sample data:
    Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
New DataFrame
   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [278]:
df24.drop(index = 1,axis = 0, inplace = True)

In [285]:
df24

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

In [ ]:
30. Write a Pandas program to widen output display to see more columns.
Sample data:

   Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [288]:
import pandas as pd

pd.set_option('display.max_rows',200)
pd.set_option('display.max_columns',200)
pd.set_option('display.width',1000)

print(df24)

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

In [ ]:
31. Write a Pandas program to select a row of series/dataframe by given integer index
Sample data:
    
Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Index-2: Details
   col1  col2  col3
2     3     6     9

In [308]:
## Inserting row in index 1 position

new_row = {'col1': [4],'col2': [5],'col3': [8]}
df = pd.DataFrame(new_row, index = [1])

In [313]:
df24 = pd.concat([df24.iloc[:0],df, df24.iloc[0:]]).reset_index(drop = True)

In [318]:
df24.iloc[[2]]

   col1  col2  col3
2     3     6     9

In [ ]:
32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.
Sample data:

Original DataFrame

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
2         2  Katherine     yes   16.5
.....
8         2      Kevin      no    8.0
9         1      Jonas     yes   19.0

New DataFrame replacing all NaN with 0:
   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
2         2  Katherine     yes   16.5
.....
8         2      Kevin      no    8.0
9         1      Jonas     yes   19.0

In [322]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [323]:
df32 = pd.DataFrame(exam_data)

In [334]:
df32.fillna(0, inplace = True)

In [335]:
df32

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes